# 1)კომენტარის სახით ახსენით რა არის slicing და ასევე რა განსხვავებაა indexing და sliceing-ს შორის


# Slicing არის მეთოდი, რომლის საშუალებითაც შეგვიძლია სიის, სტრინგის
# ან სხვა მიმდევრობის რამდენიმე ელემენტის ერთდროულად ამოჭრა.
# slicing იწერება: [start:end:step]

# Indexing გამოიყენება მხოლოდ ერთი კონკრეტული ელემენტის მისაღებად
# და იწერება ერთი ინდექსით, მაგალითად: name[0]

# განსხვავება indexing-სა და slicing-ს შორის არის ის, რომ
# indexing აბრუნებს ერთ ელემენტს,
# ხოლო slicing აბრუნებს ელემენტების ნაწილს (სიად ან სტრინგად)
